" =================================================================================================================================================
" vim configure
" Copyright 2021 nickdecodes
" License: MIT
" =================================================================================================================================================
"
" +----------+-------------------------------------------------------------------------------------------------------------------------------------
" | Key      | Function
" +----------+-------------------------------------------------------------------------------------------------------------------------------------
" | Space cr | 编译运行
" | Space rg | GDB 调试
" | Space ft | 文件浏览 (netrw)
" | Space rt | 生成 ctags
" | Space rb | 去除尾部空白
" | Space rm | 去除 ^M 字符
" | Space rw | 调整窗口大小
" | Space cw | 关闭窗口
" | Space qw | 保存退出窗口
" | Space hm | 水平分屏编辑 vimrc
" | Space vm | 垂直分屏编辑 vimrc
" | Space sm | 重新加载 vimrc
" | Esc Esc  | 保存文件
" | Ctrl c   | 可视模式复制到剪贴板
" | Ctrl p   | 粘贴剪贴板内容
" +----------+-------------------------------------------------------------------------------------------------------------------------------------
"
" Notes:
"   1、Vim 脚本注释是以 " 开头的，只存在行注释，不存在块注释
" =================================================================================================================================================

"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
" 环境设置
"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
set nocompatible                   " 关闭兼容 vi 模式，使用 Vim 自身的
set shell=$SHELL                   " Vim 需要一个符合 Posix 的 Shell
set viminfo=<100,'100,/50,:100,h,r$TEMP:,s10,!
"           |    |    |   |    | |       |   + 保存全局变量
"           |    |    |   |    | |       + 不保存超过10KB寄存器
"           |    |    |   |    | + 不保存TEMP目录下文件的相关信息
"           |    |    |   |    + 载入viminfo文件时关闭hlsearch高亮
"           |    |    |   + 保存命令历史条数
"           |    |    + 保存搜索历史条数
"           |    + 保存最近100个文件中的标记
"           + 每个寄存器中保存的行数

"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
" 选项设置
"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
" [语·法]----------------------------------------------------------------------------------------------------------------------------------[语·法] "
syntax on                           " 开启语法高亮
" [主·题]----------------------------------------------------------------------------------------------------------------------------------[主·题] "
set t_Co=256                        " 指定配色方案是256色
set background=dark                 " 主题背景
colorscheme default                 " 主题选择
" [行、列]---------------------------------------------------------------------------------------------------------------------------------[行、列] "
set number                          " 显示行号
set ruler                           " 显示光标当前位置
set linespace=0                     " 设置行间距
set linebreak                       " 设置行断点
set cursorline                      " 突出显示当前行
set cursorcolumn                    " 突出显示当前列

" [鼠·标]----------------------------------------------------------------------------------------------------------------------------------[鼠·标] "
set mouse=a                         " 启用鼠标
set whichwrap+=<,>,h,l              " 允许 Backspace 和光标键跨越行边界
set scrolloff=3                     " 光标距离顶部和底部 3 行
" [菜单栏]---------------------------------------------------------------------------------------------------------------------------------[菜单栏] "
set shortmess=atI                   " 启动的时候不显示那个援助乌干达儿童的提示
set wildmenu                        " 显示补全菜单
set showmode                        " 显示我们当前正在编辑的模式
" [搜·索]----------------------------------------------------------------------------------------------------------------------------------[搜·索] "
set hlsearch                        " 高亮搜索的字符串
set incsearch                       " 即时搜索
set ignorecase                      " 搜索忽略大小写
set smartcase                       " 智能大小写敏感，只要有一个字母大写，就大小写敏感，否则不敏感
set showmatch                       " 高亮显示匹配的括号
set matchtime=1                     " 匹配括号高亮的时间（单位是十分之一秒） 
" [缩·进]----------------------------------------------------------------------------------------------------------------------------------[缩·进] "
set tabstop=4                       " Tab 显示多少个空格，默认 8
set softtabstop=4                   " 统一缩进为 4
set shiftwidth=4                    " 每一级缩进是多少个空格
set smartindent                     " 开启智能缩进
set backspace=indent,eol,start      " 设置退格键可用
set smarttab                        " 在行和段开始处使用制表符 删除Tab一键delete
set noexpandtab                     " 不允许用空格代替制表符
set copyindent                      " 复制粘贴时保留原有的缩进
set autoindent cindent              " 启用自动对齐功能，把上一行的对齐格式应用到下一行
" [命·令]----------------------------------------------------------------------------------------------------------------------------------[命·令] "
set report=0                        " 通过使用 :commands 命令，告诉我们文件的哪一行被改变过
" [状态行]---------------------------------------------------------------------------------------------------------------------------------[状态行] "
set laststatus=2                    " 总是显示状态行
" [状态栏]---------------------------------------------------------------------------------------------------------------------------------[状态栏] "
set statusline=%F%m%r%h%w           " %文件名和路径%修改缓冲区%只读缓冲区%帮助缓冲区%预览窗口
set statusline+=\ [FORMAT=%{&ff}]   " 文件系统类型
set statusline+=\ [TYPE=%Y]\        " 文件类型
set statusline+=\ %=[POS=%l,%v]     " 行，列
set statusline+=\ [%p%%]            " 当前行数占总行数的的百分比
set statusline+=\ %{strftime(\"%Y/%m/%d-%H:%M\")} " 显示日期
" [语·言]----------------------------------------------------------------------------------------------------------------------------------[语·言] "
set encoding=utf-8                  " Vim 内部 buffer (缓冲区)、菜单文本等使用的编码方式
set fileencoding=utf-8               " 当前编辑文件的字符编码方式，保存文件也使用这种编码方式
set fileencodings=utf-8,gbk          " Vim 启动时逐一按顺序使用第一个匹配到的编码方式打开文件
set helplang=cn                     " 帮助系统设置为中文
set langmenu=en_US.UTF-8            " 显示英文菜单语言
language messages en_US.UTF-8       " 设置提示信息为英文
" [文·件]----------------------------------------------------------------------------------------------------------------------------------[文·件] "
filetype plugin indent on            " 检测文件类型，载入插件和缩进文件
set fileformat=unix                  " 设置以 UNIX 的格式保存文件
set autoread                        " 设置当文件被改动时自动载入
set autowrite                       " 文件修改自动保存
set nobackup                        " 禁止文件自动备份
set noswapfile                       " 禁止生成临时文件
set confirm                          " 在处理未保存或只读文件的时候，弹出确认
set noundofile                       " 不生成 undo 文件
set hidden                          " 允许在有未保存的修改时切换缓冲区，此时的修改由vim负责保存
" [折·叠]----------------------------------------------------------------------------------------------------------------------------------[折·叠] "
set wrap                            " 设置代码自动折行
set fo+=mB                          " 中文断行支持
set foldmethod=indent               " 基于缩进进行代码折叠
set nofoldenable                    " 启动 Vim 时关闭折叠
" [分·屏]----------------------------------------------------------------------------------------------------------------------------------[分·屏] "
set splitright                      " 竖直 split 时，在右边开启
set splitbelow                      " 水平 split 时，在下边开启
set equalalways                     " 分割窗口时保持相等的宽/高
set fillchars=vert:\ ,stl:\ ,stlnc:\ " 分屏是空白分割
" [剪贴板]---------------------------------------------------------------------------------------------------------------------------------[剪贴板] "
" set clipboard+=unnamed              " 不共享剪贴板，避免 d/x 等删除操作覆盖系统剪贴板，需要时用 <C-c>/<C-p> 手动交互
" [响·铃]----------------------------------------------------------------------------------------------------------------------------------[响·铃] "
set noerrorbells                    " 关闭错误信息响铃
set novisualbell                    " 关闭使用可视响铃代替呼叫
set t_vb=                           " 置空错误铃声的终端代码
" [补·全]----------------------------------------------------------------------------------------------------------------------------------[补·全] "
set completeopt=preview,longest     " 代码补全
" [其·它]----------------------------------------------------------------------------------------------------------------------------------[其·它] "
set magic                           " 设置魔术
set title                           " Show file in titlebar
set cino=L0                         " 在任意字符后面加冒号不会跳到行首
set history=1000                    " 记录 1000 条历史命令
set iskeyword+=_,$,@,%,#,-          " 带有如下符号的单词不要被换行分割
set textwidth=0                     " 插入文本的最大宽度，设为零关闭此项功能
set updatetime=100                  " 降低延迟和糟糕的用户体验

"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
" 自动命令
"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
augroup vimrc_general
  autocmd!
  " 正常模式高亮当前行，输入模式取消
  autocmd InsertLeave,WinEnter * set cursorline
  autocmd InsertEnter,WinLeave * set nocursorline
  " 重新打开文件时，回到上次编辑的位置
  autocmd BufReadPost * if line("'\"") > 0 && line("'\"") <= line("$") | exe("norm '\"") | endif
augroup END

augroup vimrc_filetype
  autocmd!
  autocmd BufNewFile,BufRead *.{md,mdown,mkd,mkdn,markdown,mdwn} setfiletype markdown
augroup END

augroup vimrc_template
  autocmd!
  autocmd BufNewFile *.cpp,*.[ch],*.sh,*.py,*.go,*.java call SetTitle()
  autocmd BufNewFile * normal G
augroup END

"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
" 按键映射
"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
" [剪贴板]---------------------------------------------------------------------------------------------------------------------------------[剪贴板] "
vnoremap <C-c> "+y
nnoremap <C-p> "+p
" [保存]-------------------------------------------------------------------------------------------------------------------------------------[保存] "
nnoremap <Esc><Esc> :w<CR>
" [分割窗口调整大小]------------------------------------------------------------------------------------------------------------------[分割窗口调整大小] "
nnoremap <Space>rw<Right> :vertical resize +5<CR>
nnoremap <Space>rw<Left>  :vertical resize -5<CR>
nnoremap <Space>rw<Up>    :resize +5<CR>
nnoremap <Space>rw<Down>  :resize -5<CR>
nnoremap <Space>cw :close<CR>
nnoremap <Space>qw :wq<CR>
" [文件操作]------------------------------------------------------------------------------------------------------------------------------[文件操作] "
nnoremap <Space>rb :let _s=@/<bar>:%s/\s\+$//e<bar>:let @/=_s<bar>:nohl<CR>
nnoremap <Space>rm :%s/<c-v><c-m>//g<CR>
" [vimrc 配置文件]--------------------------------------------------------------------------------------------------------------------[vimrc 配置文件] "
nnoremap <Space>hm <Esc>:sp $MYVIMRC<CR>
nnoremap <Space>vm :vsp $MYVIMRC<CR>
nnoremap <Space>sm :source $MYVIMRC<CR>
" [文件浏览]------------------------------------------------------------------------------------------------------------------------------[文件浏览] "
nnoremap <Space>ft :Lexplore<CR>
" [标签大纲]------------------------------------------------------------------------------------------------------------------------------[标签大纲] "
nnoremap <Space>rt :!ctags -R<CR>
" [编译调试]------------------------------------------------------------------------------------------------------------------------------[编译调试] "
nnoremap <Space>cr :call CompileRun()<CR>
nnoremap <Space>rg :call RunGDB()<CR>

"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
" 自定义函数
"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
" [文件头模板]------------------------------------------------------------------------------------------------------------------------[文件头模板] "
function! SetTitle() abort
  if &filetype == 'sh'
    call setline(1, "#!/bin/bash")
    call append(line("."), "")
  elseif &filetype == 'python'
    call setline(1, "#!/usr/bin/env python3")
    call append(line("."), "# -*- coding: utf-8 -*-")
    call append(line(".")+1, "")
  elseif &filetype == 'go'
    call setline(1, "package main")
    call append(line("."), "")
  elseif expand("%:e") == 'h'
    let l:guard = toupper(expand("%:r")) . "_H_"
    call setline(1, "#ifndef " . l:guard)
    call append(line("."),   "#define " . l:guard)
    call append(line(".")+1, "")
    call append(line(".")+2, "#endif")
  elseif &filetype == 'c'
    call setline(1, "#include <stdio.h>")
    call append(line("."), "")
  elseif expand("%:e") == 'cpp'
    call setline(1, "#include <iostream>")
    call append(line("."), "")
  elseif &filetype == 'java'
    call setline(1, "public class " . expand("%:r") . " {")
    call append(line("."), "}")
  endif
endfunction

" [编译运行]------------------------------------------------------------------------------------------------------------------------------[编译运行] "
function! CompileRun() abort
  exec "w"
  if &filetype == 'c'
    exec "!gcc % -o %< && time ./%<"
  elseif &filetype == 'cpp'
    exec "!g++ % -std=c++11 -o %< && time ./%<"
  elseif &filetype == 'java'
    exec "!javac % && time java %<"
  elseif &filetype == 'sh'
    exec "!time bash %"
  elseif &filetype == 'python'
    exec "!time python3 %"
  elseif &filetype == 'go'
    exec "!time go run %"
  elseif &filetype == 'html'
    exec "!open % &"
  endif
endfunction

" [GDB 调试]--------------------------------------------------------------------------------------------------------------------------------[GDB 调试] "
function! RunGDB() abort
  exec "w"
  if &filetype == 'c'
    exec "!gcc % -g -o %< && gdb ./%<"
  elseif &filetype == 'cpp'
    exec "!g++ % -std=c++11 -g -o %< && gdb ./%<"
  endif
endfunction

"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
" End
"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
